{
  "quotes": [
    {
      "tags": [
        "ethics",
        "religion",
        "utilitarianism",
        "secularism"
      ],
      "quote": "Do not be too moral. You may cheat yourself out of much life so. Aim above morality. Be not simply good, be good for something.",
      "lang": "en",
      "author": "Henry David Thoreau"
    },
    {
      "tags": [
        "transhumanism",
        "technology",
        "nature"
      ],
      "quote": "[M]en are only as good as their technical development allows them to be.",
      "lang": "en",
      "author": "George Orwell"
    },
    {
      "tags": [
        "happiness",
        "short",
        "humans"
      ],
      "quote": "[...] contempt for happiness is usually contempt for other people's happiness, and is an elegant disguise for hatred of the human race.",
      "lang": "en",
      "author": "Bertrand Russell"
    },
    {
      "tags": [
        "short",
        "design"
      ],
      "quote": "The life of a designer is a life of fight: fight against the ugliness.",
      "lang": "en",
      "author": "Massimo Vignelli"
    },
    {
      "tags": [
        "vegan",
        "cannibalism"
      ],
      "quote": "Nothing more strongly arouses our disgust than cannibalism, yet we make the same impression on Buddhists and vegetarians, for we feed on babies, though not our own.",
      "lang": "en",
      "author": "Robert Louis Stevenson"
    },
    {
      "tags": [
        "short",
        "rationalisation"
      ],
      "quote": "A man generally has two reasons for doing a thing; one that sounds good, and a real one.",
      "lang": "en",
      "author": "John Pierpont Morgan"
    },
    {
      "tags": [
        "evolution",
        "transhumanism"
      ],
      "quote": "Natural selection has \"encephalised\" our emotions to benefit our genes. Rational agents can \"re-encephalise\" our emotions to benefit us.",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "suffering",
        "ethics",
        "vegan",
        "speciesism"
      ],
      "quote": "[...] The 'Pro Life' or 'Right to Life' movement is misnamed. Far from having concern for all life, or a scale of concern impartially based on the nature of the life in question, those who protest against abortion but dine regularly on the bodies of chickens, pigs and calves, show only a biased concern for the lives of members of our own species.",
      "lang": "en",
      "author": "Peter Singer"
    },
    {
      "tags": [
        "god",
        "science",
        "evolution",
        "short"
      ],
      "quote": "The theory of evolution by cumulative natural selection is the only theory we know of that is in principle capable of explaining the existence of organized complexity.",
      "lang": "en",
      "author": "Richard Dawkins"
    },
    {
      "tags": [
        "skepticism",
        "suffering",
        "ethics",
        "transhumanism",
        "nature"
      ],
      "quote": "Can we justify the suffering of baby coots because we think their ecosystem is interesting? Earlier generations of humans liked to torture animals for their own pleasure (and some still do). We now judge this to be evil. But is standing by while animals torture each other in \"natural\" ways, when we have the power to stop it, any better than actively torturing animals? Responsible people spay or neuter their pets. Why not spay Nature herself?",
      "lang": "en",
      "author": "Sarah Perry"
    },
    {
      "tags": [
        "biology",
        "suffering",
        "ethics",
        "evolution",
        "pain",
        "animals",
        "mind"
      ],
      "quote": "Less cognitively sophisticated animals generally require stronger signals for pattern-learning. If pain is the signal, then we might reasonably expect the phenomenal intensity of pain to correlate inversely with cognitive sophistication. If that’s the case, humans experience (on average) the least intense pain in all the animal kingdom.",
      "lang": "en",
      "author": "Jason Schukraft"
    },
    {
      "tags": [
        "skepticism",
        "atheism",
        "religion",
        "society"
      ],
      "quote": "On the subject of religious belief, we relax standards of reasonableness and evidence that we rely on in every other area of our lives. We relax so totally that people believe the most ludicrous propositions, and are willing to organize their lives around them.",
      "lang": "en",
      "author": "Sam Harris"
    },
    {
      "tags": [
        "short",
        "psychology"
      ],
      "quote": "It's not what you look at that matters, it's what you see.",
      "lang": "en",
      "author": "Henry David Thoreau"
    },
    {
      "tags": [
        "short",
        "liberty",
        "freedom",
        "offense"
      ],
      "quote": "If liberty means anything at all, it means the right to tell people what they do not want to hear.",
      "lang": "en",
      "author": "George Orwell"
    },
    {
      "tags": [
        "short"
      ],
      "quote": "Nobody made a greater mistake than he who did nothing because he could do only a little.",
      "lang": "en",
      "author": "Edmund Burke"
    },
    {
      "tags": [
        "creativity",
        "procrastination",
        "entrepreneurship",
        "short"
      ],
      "quote": "Procrastinating is a vice when it comes to productivity, but it can be a virtue for creativity.",
      "lang": "en"
    },
    {
      "tags": [
        "technology",
        "society"
      ],
      "quote": "The most profound technologies are those that disappear. They weave themselves into the fabric of everyday life until they are indistinguishable from it.",
      "lang": "en",
      "author": "Mark Weiser"
    },
    {
      "tags": [
        "skepticism",
        "history"
      ],
      "quote": "The inability to predict outliers implies the inability to predict the course of history, given the share of these events in the dynamics of events.",
      "lang": "en",
      "author": "Nassim Nicholas Taleb"
    },
    {
      "who": "Richard Noonan",
      "tags": [
        "fiction",
        "short",
        "money"
      ],
      "quote": "[A] person needs money in order to never think about them.",
      "lang": "en",
      "author": "Arkady Strugatsky, Boris Strugatsky"
    },
    {
      "tags": [
        "ai",
        "consciousness"
      ],
      "quote": "We're always changing boundaries! Where does an elbow start or end? When does a youth become an adult? Where does an ocean change into a sea? Why must our minds keep drawing lines to structure our reality? The answer is that unless we made those mind-constructed boundaries, we'd never see any thing at all! This is because we rarely see anything twice as exactly the same. Each time we're almost certain to be looking from a somewhat different view, perhaps from nearer or farther, higher or lower, in a different color or shade of light, or against a different background.",
      "lang": "en",
      "author": "Marvin Minsky"
    },
    {
      "tags": [
        "despair",
        "god",
        "atheism",
        "suffering"
      ],
      "quote": "In the God-universe, God prohibits [horrible things]. To recognize this is to recognize that we don't live in that universe. We live in the what-if universe beyond the reach of God, driven by the mathematical laws and nothing else. Whatever physics says will happen, will happen. Absolutely anything, good or bad, will happen. And there is nothing in the laws of physics to lift this rule even for the really extreme cases, where you might expect Nature to be a little more reasonable.",
      "lang": "en",
      "author": "Eliezer Yudkowsky"
    },
    {
      "tags": [
        "motto",
        "suffering",
        "short",
        "transhumanism",
        "negative utilitarianism"
      ],
      "quote": "Less suffering, more happiness, and more life in the Universe. But in that order.",
      "lang": "en",
      "author": "Manu Herrán"
    },
    {
      "tags": [
        "evolution",
        "society",
        "males",
        "policy"
      ],
      "quote": "In my view, conspicuous charity is at least as natural as conspicuous consumption, and we are free to decide which should be more respected in our society. In other words, discovering better ways of managing human sexual competitiveness should be the explicit core of social policy.",
      "lang": "en",
      "author": "Geoffrey Miller"
    },
    {
      "tags": [
        "science",
        "transhumanism",
        "future",
        "altruism",
        "paradise engineering"
      ],
      "quote": "[T]rue hedonic engineering, as distinct from mindless hedonism or reckless personal experimentation, can be profoundly good for our character. Character-building technologies can benefit utilitarians and non-utilitarians alike. Potentially, we can use a convergence of biotech, nanorobotics and information technology to gain control over our emotions and become better (post-)human beings, to cultivate the virtues, strength of character, decency, to become kinder, friendlier, more compassionate: to become the type of (post)human beings that we might aspire to be, but aren't, and biologically couldn't be, with the neural machinery of unenriched minds. Given our Darwinian biology, too many forms of admirable behaviour simply aren't rewarding enough for us to practise them consistently: our second-order desires to live better lives as better people are often feeble echoes of our baser passions.",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "software engineering",
        "programming"
      ],
      "quote": "Every piece of knowledge must have a single, unambiguous, authoritative representation within a system.",
      "lang": "en",
      "author": "Andy Hunt, Dave Thomas"
    },
    {
      "tags": [
        "ethics",
        "vegan",
        "discrimination",
        "speciesism"
      ],
      "quote": "It's not that there are no differences between human and non-human animals, any more than there are no differences between black people and white people, freeborn citizens and slaves, men and women, Jews and gentiles, gays or heterosexuals. The question is rather: are they morally relevant differences? This matters because morally catastrophic consequences can ensue when we latch on to a real but morally irrelevant difference between sentient beings.",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "security",
        "guideline",
        "short",
        "software engineering",
        "technology"
      ],
      "quote": "[...] if you know (or even suspect!) your database was exposed, the very first thing you should do is reset everyone's password.",
      "lang": "en",
      "author": "Jeff Atwood"
    },
    {
      "tags": [
        "skepticism",
        "atheism",
        "short",
        "religion",
        "rationality"
      ],
      "quote": "Choosing beliefs freely is not what rational minds do.",
      "lang": "en",
      "author": "Sam Harris"
    },
    {
      "tags": [
        "antinatalism",
        "life",
        "ethics",
        "short",
        "society",
        "negative utilitarianism"
      ],
      "quote": "It's one hell of an [arrogant] thing to do to [...] force something to live a life that might be horrible.",
      "lang": "en",
      "author": "Inmendham"
    },
    {
      "tags": [
        "god",
        "atheism",
        "religion",
        "rationality",
        "morality"
      ],
      "quote": "The very fact that a religious person would be afraid of God withdrawing Its threat to punish them for committing murder, shows that they have a revulsion of murder which is independent of whether God punishes murder or not.  If they had no sense that murder was wrong independently of divine retribution, the prospect of God not punishing murder would be no more existentially horrifying than the prospect of God not punishing sneezing.",
      "lang": "en",
      "author": "Eliezer Yudkowsky"
    },
    {
      "tags": [
        "short",
        "utilitarianism",
        "change",
        "strategy"
      ],
      "quote": "[I]t’s more important to try and produce a change in the right direction than to be personally pure yourself.",
      "lang": "en",
      "author": "Peter Singer"
    },
    {
      "tags": [
        "skepticism",
        "short",
        "humans",
        "society"
      ],
      "quote": "I find that the whiter my hair becomes the more ready people are to believe what I say.",
      "lang": "en",
      "author": "Bertrand Russell"
    },
    {
      "tags": [
        "short",
        "computer science",
        "advice",
        "programming",
        "algorithms",
        "heuristic"
      ],
      "quote": "When in doubt, use brute force.",
      "lang": "en",
      "author": "Ken Thompson"
    },
    {
      "tags": [
        "ethics",
        "vegan",
        "discrimination",
        "speciesism"
      ],
      "quote": "If possessing a higher degree of intelligence does not entitle one human to use another for his or her own ends, how can it entitle humans to exploit non-humans?",
      "lang": "en",
      "author": "Peter Singer"
    },
    {
      "tags": [
        "saying",
        "short"
      ],
      "quote": "If it happens, it's possible.",
      "lang": "en"
    },
    {
      "tags": [
        "success",
        "short",
        "advice"
      ],
      "quote": "What you did to become successful is likely to become counterproductive when applied at a later date.",
      "lang": "en",
      "author": "Richard Hamming"
    },
    {
      "tags": [
        "antinatalism",
        "life",
        "death",
        "ethics"
      ],
      "quote": "Regretting having to die should be structurally identical to regretting being born, because it is not in our power being born in a non-mortal way.",
      "lang": "en",
      "author": "Julio Cabrera"
    },
    {
      "tags": [
        "suffering",
        "ethics",
        "pain",
        "short"
      ],
      "quote": "\"[A] major ethical emergency\" is how a sufferer of cluster headaches recently described it to me.",
      "lang": "en",
      "author": "Andrés Gómez Emilsson"
    },
    {
      "tags": [
        "short",
        "analogy",
        "software engineering",
        "ux",
        "design",
        "ui"
      ],
      "quote": "A user interface is like a joke. If you have to explain it, it's not that good.",
      "lang": "en",
      "author": "Martin LeBlanc"
    },
    {
      "tags": [
        "science",
        "short",
        "rationality",
        "statistics"
      ],
      "quote": "[A]ll models are wrong, but some are useful.",
      "lang": "en",
      "author": "George Edward Pelham Box"
    },
    {
      "tags": [
        "software engineering",
        "programming",
        "heuristic"
      ],
      "quote": "Design the interclass interfaces to be insensitive to the potential changes. The class’s interface should protect its secrets.",
      "lang": "en"
    },
    {
      "tags": [
        "atheism",
        "ethics",
        "religion"
      ],
      "quote": "[W]hat special competence does a priest, rabbi, or imam have to judge the ethical implications of embryonic stem-cell research, family planning, or preventative war? The truth is that a person’s knowledge of a scriptural tradition is no more relevant to ethics than it is to astronomy.",
      "lang": "en",
      "author": "Sam Harris"
    },
    {
      "tags": [
        "advice",
        "humans",
        "society",
        "change"
      ],
      "quote": "Remember that not everyone is as strong as you are. Be mindful of human weakness, and of the fact that it may be more important, in the long run, to get many people taking steps in the right direction than to have fewer achieving the ideal.",
      "lang": "en",
      "author": "Peter Singer"
    },
    {
      "tags": [
        "suffering",
        "ethics",
        "pain",
        "psychology"
      ],
      "quote": "[W]hen intense physical or psychological distress intrudes - either in one's own life or that of a loved one - we recognize that this intense pain has immediate priority and urgency. If you are in agony after catching your hand in the door, then you'd give short shrift to someone who urged you to remember the finer things in life. If you're distraught after an unhappy love affair, then you don't want to be tactlessly reminded it's a beautiful day outside.",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "ux",
        "design"
      ],
      "quote": "Design isn't crafting a beautiful textured button with breathtaking animation. It's figuring out if there's a way to get rid of the button altogether.",
      "lang": "en",
      "author": "Edward Tufte"
    },
    {
      "tags": [
        "science",
        "ai",
        "brain"
      ],
      "quote": "Some people find it difficult to understand how we can see the world properly when the image is upside down. The right way to think about this is to adopt a computational perspective. We do not perceive what is on the retina; instead, a percept is formed through a complex chain of neural computations. A control computer does not care which way is up, and inversion of the image is the least of the brain's computational problems.",
      "lang": "en",
      "author": "Colin Ware"
    },
    {
      "tags": [
        "advice",
        "design"
      ],
      "quote": "Design graphic representations of data by taking into account human sensory capabilities in such a way that important data elements and data patterns can be quickly perceived.",
      "lang": "en",
      "author": "Colin Ware"
    },
    {
      "tags": [
        "ux",
        "design"
      ],
      "quote": "There are two different aspects to a reminder: the signal and the message. Just as in doing an action we can distinguish between knowing what can be done and knowing how to do it, in reminding we must distinguish between the signal—knowing that something is to be remembered, and the message—remembering the information itself.",
      "lang": "en",
      "author": "Don Norman"
    },
    {
      "tags": [
        "computer science",
        "technology",
        "algorithms",
        "moore's law",
        "progress"
      ],
      "quote": "When it comes to the growth of the size of problems we can attack with an algorithm, we have a reversal: exponential algorithms make polynomially slow progress, while polynomial algorithms advance exponentially fast! For Moore's law to be reflected in the world we need efficient algorithms.",
      "lang": "en",
      "author": "Christos Papadimitriou, Sanjoy Dasgupta, Umesh Vazirani"
    },
    {
      "tags": [
        "suffering",
        "ethics"
      ],
      "quote": "[I]n the case of extreme suffering, one can argue that the word \"problem\" is a strong contender for most understated euphemism in history.",
      "lang": "en",
      "author": "Magnus Vinding"
    },
    {
      "tags": [
        "ethics",
        "short",
        "humans"
      ],
      "quote": "Custom will reconcile people to any atrocity, and fashion will drive them to acquire any custom.",
      "lang": "en",
      "author": "George Bernard Shaw"
    },
    {
      "tags": [
        "skepticism",
        "history",
        "short",
        "rationality"
      ],
      "quote": "What is surprising is not the magnitude of our forecast errors, but our absence of awareness of it.",
      "lang": "en",
      "author": "Nassim Nicholas Taleb"
    },
    {
      "tags": [
        "politics",
        "humans",
        "society"
      ],
      "quote": "In our age there is no such thing as \"keeping out of politics.\" All issues are political issues, and politics itself is a mass of lies, evasions, folly, hatred and schizophrenia.",
      "lang": "en",
      "author": "George Orwell"
    },
    {
      "tags": [
        "short",
        "mathematics",
        "rationality",
        "logic"
      ],
      "quote": "If an assertion implies something false, then the assertion itself must be false.",
      "lang": "en"
    },
    {
      "tags": [
        "short",
        "advice",
        "game design",
        "gamification"
      ],
      "quote": "Make the fun part also the correct strategy to win.",
      "lang": "en",
      "author": "Mark Rosewater"
    },
    {
      "tags": [
        "science",
        "skepticism",
        "atheism",
        "religion"
      ],
      "quote": "One of the things that is wrong with religion is that it teaches us to be satisfied with answers which are not really answers at all.",
      "lang": "en",
      "author": "Richard Dawkins"
    },
    {
      "tags": [
        "humans",
        "society"
      ],
      "quote": "The first thing to learn in intercourse with others is noninterference with their own peculiar ways of being happy, provided those ways do not assume to interfere by violence with ours.",
      "lang": "en",
      "author": "William James"
    },
    {
      "tags": [
        "suffering",
        "ethics",
        "utilitarianism",
        "negative utilitarianism"
      ],
      "quote": "[F]rom the moral point of view, pain cannot be outweighed by pleasure, and especially not one man's pain by another man's pleasure. Instead of the greatest happiness for the greatest number, one should demand, more modestly, the least amount of avoidable suffering for all; [...]",
      "lang": "en",
      "author": "Karl Popper"
    },
    {
      "tags": [
        "mathematics"
      ],
      "quote": "Internal consistency does not require all theorems to come out true, but merely that they come out compatible with one another.",
      "lang": "en",
      "author": "Douglas Hofstadter"
    },
    {
      "tags": [
        "marketing",
        "software engineering",
        "programming",
        "design"
      ],
      "quote": "Simplicity is a great virtue but it requires hard work to achieve it and education to appreciate it. And to make matters worse: complexity sells better.",
      "lang": "en",
      "author": "Edsger Wybe Dijkstra"
    },
    {
      "tags": [
        "society",
        "policy"
      ],
      "quote": "[...] The prospect of earning more money sometimes leads people to make greater efforts to use the abilities they have, and these greater efforts can benefit patients, customers, students, or the public as a whole. It might therefore be worth trying to reward effort, which would mean paying people more if they worked near the upper limits of their abilities, whatever those abilities might be.",
      "lang": "en",
      "author": "Peter Singer"
    },
    {
      "tags": [
        "science",
        "short",
        "rationality",
        "language"
      ],
      "quote": "Every word or concept, clear as it may seem to be, has only a limited range of applicability.",
      "lang": "en",
      "author": "Werner Heisenberg"
    },
    {
      "tags": [
        "skepticism",
        "transhumanism",
        "consciousness",
        "brain"
      ],
      "quote": "Our present-day neurochemical cocktail, we are asked to believe, is the medium through which alien realms of consciousness can be grasped and neutrally appraised from a third-person perspective. Empirical research suggests this optimism is at best naïve.",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "drugs",
        "transhumanism",
        "society"
      ],
      "quote": "If it's socially acceptable to take a drug that makes you temporarily happy and stupid, then why not rationally design drugs to make people perpetually happier and smarter?",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "skepticism",
        "atheism",
        "religion",
        "society"
      ],
      "quote": "As an atheist, I am angry that we live in a society in which the plain truth cannot be spoken without offending 90% of the population.",
      "lang": "en",
      "author": "Sam Harris"
    },
    {
      "tags": [
        "skepticism",
        "irony",
        "superstition"
      ],
      "quote": "You know, the most amazing thing happened to me tonight... I saw a car with the license plate ARW 357. Can you imagine? Of all the millions of license plates in the state, what was the chance that I would see that particular one tonight? Amazing!",
      "lang": "en",
      "author": "Richard Feynman"
    },
    {
      "tags": [
        "science",
        "skepticism",
        "atheism",
        "short",
        "religion"
      ],
      "quote": "That which can be asserted without evidence, can be dismissed without evidence.",
      "lang": "en",
      "author": "Christopher Hitchens"
    },
    {
      "tags": [
        "software engineering",
        "programming"
      ],
      "quote": "A spot of code is referentially transparent when it can be substituted for its evaluated value without changing the behavior of the program.",
      "lang": "en",
      "author": "Brian Lonsdorf"
    },
    {
      "tags": [
        "short",
        "software engineering",
        "programming"
      ],
      "quote": "The fact that a program can find a solution in principle does not mean that the program contains any of the mechanisms needed to find it in practice.",
      "lang": "en"
    },
    {
      "tags": [
        "short",
        "computer science",
        "software engineering",
        "startup",
        "programming"
      ],
      "quote": "The computing scientist's main challenge is not to get confused by the complexities of his own making.",
      "lang": "en",
      "author": "Edsger Wybe Dijkstra"
    },
    {
      "tags": [
        "ethics",
        "transhumanism",
        "technology",
        "politics",
        "society"
      ],
      "quote": "The notion that all reproductive decisions will be socially regulated in a post-ageing world is abhorrent to one's libertarian instincts; but if they weren't regulated, then the earth would soon simply exceed its carrying capacity - whether it is 15 billion people or even 150 billion.",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "negotiating",
        "humans"
      ],
      "quote": "Interests motivate people; they are the silent movers behind the hubbub of positions. Your position is something you have decided upon. Your interests are what caused you to so decide.",
      "lang": "en",
      "author": "Roger Fisher, William Ury"
    },
    {
      "who": "Dr. Valentine Pilman",
      "tags": [
        "god",
        "science",
        "skepticism",
        "atheism",
        "fiction"
      ],
      "quote": "The hypothesis of God, for instance, gives an incomparably absolute opportunity to understand everything and know absolutely nothing. Give man an extremely simplified system of the world and explain every phenomenon away on the basis of that system. An approach like that doesn't require any knowledge. Just a few memorized formulas plus so-called intuition and so-called common sense.",
      "lang": "en",
      "author": "Arkady Strugatsky, Boris Strugatsky"
    },
    {
      "tags": [
        "mathematics",
        "recursion",
        "paradox"
      ],
      "quote": "[A] recursive definition (when properly formulated) never leads to infinite regress or paradox. This is because a recursive definition never defines something in terms of itself, but always in terms of simpler versions of itself.",
      "lang": "en",
      "author": "Douglas Hofstadter"
    },
    {
      "tags": [
        "short",
        "advice",
        "psychology"
      ],
      "quote": "Fake it till you make it.",
      "lang": "en"
    },
    {
      "tags": [
        "skepticism",
        "ai",
        "simulation",
        "consciousness",
        "panpsychism"
      ],
      "quote": "\"Raw feels\", by their very nature, cannot be mere abstractra. There could be no such chimerical beast as a \"virtual\" quale, let alone full-blown virtual minds made up of abstract qualia. Unitary phenomenal minds cannot subsist as mere layers of computational abstraction. Or rather if they were to do so, then we would be confronted with a mysterious Explanatory Gap, analogous to the explanatory gap that would open up if the population of China suddenly ceased to be an interconnected aggregate of skull-bound minds, and was miraculously transformed into a unitary subject of experience [...].",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "god",
        "atheism"
      ],
      "quote": "We are all atheists about most of the gods that societies have ever believed in. Some of us just go one god further.",
      "lang": "en",
      "author": "Richard Dawkins"
    },
    {
      "tags": [
        "suffering",
        "ethics",
        "transhumanism",
        "paradise engineering",
        "nature"
      ],
      "quote": "The pitfall to this \"safety-first\" approach lies in the extreme risk of moral complacency it breeds. Hundreds of millions of human beings, and billions of non-human animals, are not in such a fortunate position. On a universalist utilitarian ethic, or simply a Buddhist-style ethic of compassion, we should systematically apply the same level of urgency to relieving their suffering as one would be justified in exercising if one were oneself tormented by intense pain or suicidal despair. Extreme suffering is the plight of billions of sentient beings alive today, whether in our factory-farms, in a Darwinian state of nature, or a depressed neighbour. Desperate straits mandate taking risks one would otherwise shun.",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "suffering",
        "ethics",
        "future",
        "s-risks",
        "x-risks",
        "effective altruism"
      ],
      "quote": "[I]nstead of trying to ensure that humanity survives, we should prioritize making the future less bad, in case it will contain sentient life.",
      "lang": "en",
      "author": "Simon Knutsson"
    },
    {
      "tags": [
        "ethics",
        "short",
        "transhumanism",
        "technology",
        "politics",
        "society"
      ],
      "quote": "The biggest obstacles to a cruelty-free world - a world cured of any obligate suffering - are ideological, not technical.",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "economy",
        "corruption",
        "short",
        "business",
        "society"
      ],
      "quote": "Profits are private, losses are socialized.",
      "lang": "en"
    },
    {
      "tags": [
        "ethics",
        "history",
        "short",
        "future"
      ],
      "quote": "Being on the right side of history is no less important than being on the right side of futurology.",
      "lang": "en"
    },
    {
      "tags": [
        "skepticism",
        "suffering",
        "ethics",
        "nature",
        "rationality"
      ],
      "quote": "When we appeal to nature, we conflate how things are with how things should be. We present facts as values.",
      "lang": "en",
      "author": "Matthew Allcock"
    },
    {
      "tags": [
        "philosophy",
        "nihilism",
        "skepticism",
        "short",
        "rationality",
        "logic"
      ],
      "quote": "If nihilism is true, it doesn't matter what I do, so I might as well assume it's false.",
      "lang": "en"
    },
    {
      "tags": [
        "short",
        "irony"
      ],
      "quote": "[T]heir fundamental design flaws are completely hidden by their superficial design flaws.",
      "lang": "en",
      "author": "Douglas Adams"
    },
    {
      "tags": [
        "short"
      ],
      "quote": "It will happen unless it doesn't",
      "lang": "en"
    },
    {
      "tags": [
        "software engineering",
        "management",
        "business"
      ],
      "quote": "[A] good estimate is an estimate that provides a clear enough view of the project reality to allow the project leadership to make good decisions about how to control the project to hit its targets.",
      "lang": "en",
      "author": "Steve McConnell"
    },
    {
      "tags": [
        "software",
        "short",
        "business",
        "technology",
        "startup"
      ],
      "quote": "[S]oftware is eating the world.",
      "lang": "en",
      "author": "Marc Andreessen"
    },
    {
      "tags": [
        "drugs",
        "philosophy",
        "science",
        "skepticism",
        "ethics",
        "consciousness",
        "mind"
      ],
      "quote": "To see clearly the nature of value it is best to examine it at its extremes (such as MDMA bliss vs. the pain of kidney stones). Having such experiences illuminates the “ought” aspect of consciousness, in contrast to the typical quasi-anhedonic “normal everyday states of consciousness” that most people (and philosophers!) tend to reason from. It would be interesting to see philosophers discuss e.g. the Is-Ought problem while on MDMA.",
      "lang": "en",
      "author": "Andrés Gómez Emilsson"
    },
    {
      "tags": [
        "consciousness"
      ],
      "quote": "Consciousness has to be something, and it's not any stranger for it to be certain physical operations than for it to be anything else.",
      "lang": "en",
      "author": "Brian Tomasik"
    },
    {
      "tags": [
        "evolution",
        "ai",
        "consciousness"
      ],
      "quote": "Understanding our own case involves seeing how we fit into the total picture of biological evolution and its products, including other possible systems on other planets, and also in future robots. It is important to pursue this idea without assuming that states of consciousness of other animals can be expressed in our language. E.g. ‘the deer sees the lion approaching’ may be inappropriate if it implies that the deer uses something like our concepts of \"lion\" and \"approaching\". We must allow for the existence of forms of experience that we cannot describe.",
      "lang": "en",
      "author": "Aaron Sloman, Ron Chrisley"
    },
    {
      "tags": [
        "ethics",
        "vegan",
        "discrimination",
        "speciesism",
        "evolution",
        "animals",
        "humans"
      ],
      "quote": "[O]ur anthropocentric bias is deeply rooted. Hunting, killing, and exploiting members of other species enhanced the inclusive fitness of our genes in the ancestral environment. [Here we are more akin to chimpanzees than bonobos.] So unlike, say, the incest taboo, we don't have an innate predisposition to find, say, hunting and exploiting non-human animals wrong.",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "suffering",
        "horror",
        "psychedelic"
      ],
      "quote": "[I]t isn't difficult to dissociate one's feelings from a mere printed litany of frightfulness. It's easy to convince oneself that things can't really be that terrible, that the horror I allude to is being overblown, that what is going on elsewhere in space-time is somehow less real than the here-and-now, or that the good in the world somehow offsets the bad. Yet however vividly one thinks one can imagine what agony, torture or suicidal despair must be like, the reality is inconceivably worse. The force of \"inconceivably\" is itself largely inconceivable here. Blurry images of Orwell's \"Room 101\" can barely even hint at what I'm talking about. Even if one's ancestral namesakes [aka \"younger self\"] underwent great pain, then the state-dependence of memories means that much of pain's sheer dreadfulness is semantically, cognitively and emotionally inaccessible in the here-and-now.",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "short",
        "software engineering",
        "management",
        "business",
        "startup"
      ],
      "quote": "Adding manpower to a late software project makes it later.",
      "lang": "en",
      "author": "Frederick Brooks"
    },
    {
      "tags": [
        "poverty",
        "wealth",
        "ethics",
        "policy"
      ],
      "quote": "Nevertheless the uncontroversial appearance of the principle that we ought to prevent what is bad when we can do so without sacrificing anything of comparable moral significance is deceptive. If it were taken seriously and acted upon, our lives and our world would be fundamentally changed. For the principle applies, not just to rare situations in which one can save a child from a pond, but to the everyday situation in which we can assist those living in absolute poverty.",
      "lang": "en",
      "author": "Peter Singer"
    },
    {
      "tags": [
        "science",
        "ethics",
        "short"
      ],
      "quote": "[F]olk morality is a doomed enterprise as hopeless as folk physics.",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "science",
        "skepticism",
        "mathematics"
      ],
      "quote": "[...] to say that \"mathematics describes the physical world miraculously well\" is akin to claiming that \"words describe the world around us miraculously well\".",
      "lang": "en",
      "author": "Magnus Vinding"
    },
    {
      "tags": [
        "philosophy",
        "ethics",
        "evolution",
        "short"
      ],
      "quote": "High-minded philosophy treatises should complicate but not confuse the primacy of the pleasure-pain axis.",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "short",
        "computer science",
        "software engineering",
        "programming"
      ],
      "quote": "In software design, separating what operations do from how they do it is known as abstraction.",
      "lang": "en",
      "author": "Thomas H. Cormen"
    },
    {
      "tags": [
        "suffering",
        "transhumanism"
      ],
      "quote": "If there is a fair(er) universe, we have to get there starting from this world—the neutral world, the world of hard concrete with no padding, the world where challenges are not calibrated to your skills.",
      "lang": "en",
      "author": "Eliezer Yudkowsky"
    },
    {
      "tags": [
        "science",
        "skepticism",
        "short",
        "religion",
        "rationality"
      ],
      "quote": "A wise man [...] proportions his belief to the evidence.",
      "lang": "en",
      "author": "David Hume"
    },
    {
      "tags": [
        "antinatalism",
        "humor",
        "short"
      ],
      "quote": "Life is like animal porn: it's not for everyone.",
      "lang": "en",
      "author": "Doug Stanhope"
    },
    {
      "tags": [
        "short",
        "humans",
        "psychology"
      ],
      "quote": "Remember that a person's name is, to that person, the sweetest and most important sound in any language.",
      "lang": "en",
      "author": "Dale Carnegie"
    },
    {
      "tags": [
        "depression",
        "suffering",
        "short",
        "brain"
      ],
      "quote": "You can rationalize all you want; the hippocampus takes the insult of chronic stress seriously, incurring irreversible atrophy.",
      "lang": "en",
      "author": "Nassim Nicholas Taleb"
    },
    {
      "tags": [
        "short",
        "software engineering",
        "programming",
        "testing"
      ],
      "quote": "Testing shows the presence, not the absence of bugs.",
      "lang": "en",
      "author": "Edsger Wybe Dijkstra"
    },
    {
      "tags": [
        "atheism",
        "religion",
        "rationality"
      ],
      "quote": "How many religious people would retain their belief in God, if they could accurately visualize that hypothetical world in which there was no God and they themselves have become atheists?",
      "lang": "en",
      "author": "Eliezer Yudkowsky"
    },
    {
      "tags": [
        "short",
        "technology",
        "brain",
        "psychology",
        "mind"
      ],
      "quote": "As we use an electronic medium, our nervous system extends outward, and the medium extends inward.",
      "lang": "en",
      "author": "Norman Doidge"
    },
    {
      "tags": [
        "short",
        "politics",
        "manipulation"
      ],
      "quote": "Political language [...] is designed to make lies sound truthful and murder respectable, and to give an appearance of solidity to pure wind.",
      "lang": "en",
      "author": "George Orwell"
    },
    {
      "tags": [
        "startup",
        "ux",
        "product"
      ],
      "quote": "Y'all talk about UX like it's just another feature. For a user, it literally is the product. Full stop. Everything else is inside baseball.",
      "lang": "en",
      "author": "Startup L. Jackson"
    },
    {
      "tags": [
        "definition",
        "computer science",
        "software engineering",
        "programming"
      ],
      "quote": "Mutable structures are representing pointers to the memory. Immutable structures are representing values.",
      "lang": "en"
    },
    {
      "tags": [
        "ethics",
        "short",
        "rationality",
        "reason"
      ],
      "quote": "Reason shows me that if my happiness is desirable and good, the equal happiness of any other person must be equally desirable.",
      "lang": "en",
      "author": "Henry Sidgwick"
    },
    {
      "tags": [
        "advice",
        "negotiating"
      ],
      "quote": "If you want someone to listen and understand your reasoning, give your interests and reasoning first and your conclusions or proposals later.",
      "lang": "en",
      "author": "Roger Fisher, William Ury"
    },
    {
      "tags": [
        "politics",
        "ideas"
      ],
      "quote": "[T]here's no forces stopping us from making [the world] better, from fixing it; and the only thing stopping us is the fact that we don't have right ideas in people's [...] heads.",
      "lang": "en",
      "author": "Inmendham"
    },
    {
      "tags": [
        "suffering",
        "animals",
        "earth"
      ],
      "quote": "If we imagined that from now on, animals started emitting a red light every time they suffered, then from space, Earth would no longer be a blue planet, but a red and glowing on.",
      "lang": "en",
      "author": "Ole Martin Moen"
    },
    {
      "tags": [
        "short",
        "rationality",
        "advice",
        "argument"
      ],
      "quote": "When a word poses a problem, the simplest solution is to eliminate the word and its synonyms.",
      "lang": "en",
      "author": "Eliezer Yudkowsky"
    },
    {
      "tags": [
        "software engineering",
        "programming"
      ],
      "quote": "Code comments that tell you nothing useful are a waste of space. The code will always tell you how something is done; code comments should tell you why.",
      "lang": "en",
      "author": "Edward Guiness"
    },
    {
      "tags": [
        "science",
        "ethics",
        "transhumanism",
        "future"
      ],
      "quote": "Can Ethics ever aspire to be a rigorous academic discipline that delivers an impartial perspective embracing the interests of all sentient life: the well being of posthuman, human and non-human animals; hypothetical extra-terrestrial life, future \"cyborgs\", and artificial life alike? Or will Ethics always serve to rationalize the self-interest of the world’s most powerful lifeforms?",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "ai",
        "humans",
        "society",
        "intelligence",
        "knowledge"
      ],
      "quote": "It is essentially this you can do with a human that you cannot do with a chimpanzee: train them to contribute modestly to society. To become a well-connected neuron in the collective human brain. Without the knowledge and tools of previous generations, humans are largely indistinguishable from chimpanzees.",
      "lang": "en",
      "author": "Magnus Vinding"
    },
    {
      "tags": [
        "engineering",
        "science",
        "advice"
      ],
      "quote": "In science if you know what you are doing you should not be doing it. In engineering if you do not know what you are doing you should not be doing it.",
      "lang": "en",
      "author": "Richard Hamming"
    },
    {
      "tags": [
        "ethics",
        "vegan",
        "transhumanism"
      ],
      "quote": "[G]reater intelligence brings a greater cognitive capacity for empathy - and potentially an extended circle of compassion. Maybe our superintelligent/superempathetic descendants will view non-human animal abuse as no less abhorrent than we view child abuse: a terrible perversion.",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "short",
        "ai",
        "transhumanism",
        "humans",
        "mind"
      ],
      "quote": "If you still find it astounding that minds could run on silicon chips, consider how absolutely remarkable it is that our minds run on meat!",
      "lang": "en",
      "author": "John G. Messerly"
    },
    {
      "tags": [
        "software engineering",
        "programming"
      ],
      "quote": "There are two ways of constructing a software design: one way is to make it so simple that there are obviously no deficiencies, and the other is to make it so complicated that there are no obvious deficiencies.",
      "lang": "en",
      "author": "Tony Hoare"
    },
    {
      "tags": [
        "empathy",
        "skepticism"
      ],
      "quote": "If you made a sadist more empathic, it would just lead to a happier sadist[.]",
      "lang": "en",
      "author": "Paul Bloom"
    },
    {
      "tags": [
        "short",
        "game design"
      ],
      "quote": "If the player solves a puzzle and doesn't understand it, you have failed.",
      "lang": "en"
    },
    {
      "tags": [
        "science",
        "short",
        "rationality"
      ],
      "quote": "Your strength as a rationalist is your ability to be more confused by fiction than by reality[.]",
      "lang": "en",
      "author": "Eliezer Yudkowsky"
    },
    {
      "tags": [
        "impact",
        "short",
        "effective altruism"
      ],
      "quote": "If you can help 1000 people be 1% more effective, then that’s like having the impact of 10 people.",
      "lang": "en",
      "author": "Ben Todd"
    },
    {
      "tags": [
        "science",
        "rationality"
      ],
      "quote": "If you don't notice when your model makes the evidence unlikely, you might as well have no model, and also you might as well have no evidence; no brain and no eyes.",
      "lang": "en",
      "author": "Eliezer Yudkowsky"
    },
    {
      "tags": [
        "transhumanism",
        "humans"
      ],
      "quote": "[T]he only justification for the existence of Homo sapiens is our role as stepping-stone to something better.",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "short",
        "software engineering",
        "advice",
        "utilitarianism",
        "productivity"
      ],
      "quote": "Where two or more tools can perform the same task, choose the one that allows for the most valuable work to be done per unit time.",
      "lang": "en",
      "author": "Colin Ware"
    },
    {
      "tags": [
        "atheism",
        "religion"
      ],
      "quote": "One cannot really be a Catholic and grown up.",
      "lang": "en",
      "author": "George Orwell"
    },
    {
      "tags": [
        "life",
        "short"
      ],
      "quote": "[Life] is an unpleasant interruption of nothing, and the best thing you can say of it is that it does not last long.",
      "lang": "en",
      "author": "Clarence Darrow"
    },
    {
      "tags": [
        "ethics",
        "rationality"
      ],
      "quote": "Ethical terms belong to ethics, and the proper sphere of ethics is not determined by the boundaries of other disciplines.",
      "lang": "en",
      "author": "Ole Martin Moen"
    },
    {
      "tags": [
        "ethics",
        "short",
        "humans"
      ],
      "quote": "We are all flawed and creatures of our times.",
      "lang": "en",
      "author": "Carl Sagan"
    },
    {
      "tags": [
        "suffering",
        "evolution",
        "transhumanism"
      ],
      "quote": "If we want to create a world free from suffering, we will have to contend with the fact that suffering is adaptive in certain environments. The solution here is to avoid such environments, and foster ecosystems of mind that give an evolutionary advantage to the super-happy.",
      "lang": "en",
      "author": "Andrés Gómez Emilsson"
    },
    {
      "tags": [
        "ethics",
        "evolution",
        "transhumanism",
        "future",
        "paradise engineering",
        "humans"
      ],
      "quote": "Too many of our preferences reflect nasty behaviours and states of mind that were genetically adaptive in the ancestral environment. Instead, wouldn't it be better if we rewrote our own corrupt code?",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "humanity",
        "evolution",
        "transhumanism",
        "x-risks"
      ],
      "quote": "Far from being the smartest possible biological species, we are probably better thought of as the stupidest possible biological species capable of starting a technological civilization – a niche we filled because we got there first, not because we are in any sense optimally adapted to it.",
      "lang": "en",
      "author": "Nick Bostrom"
    },
    {
      "tags": [
        "evil",
        "ethics",
        "short",
        "humans",
        "society"
      ],
      "quote": "Almost no one is evil. Almost everything is broken.",
      "lang": "en"
    },
    {
      "tags": [
        "god",
        "science",
        "atheism",
        "short",
        "technology",
        "religion"
      ],
      "quote": "There is no great invention, from fire to flying, which has not been hailed as an insult to some god.",
      "lang": "en",
      "author": "John Burdon Sanderson Haldane"
    },
    {
      "tags": [
        "immortality",
        "ai",
        "consciousness",
        "irony"
      ],
      "quote": "[S]ince every finite string of digits occurs in the decimal expansion of the transcendental number pi, your uploaded \"mindfile\" is timelessly encoded there too - an infinite number of times. Alas immortality isn't that cheap.",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "science",
        "analogy",
        "ai"
      ],
      "quote": "AI researchers have devoted little effort to passing the Turing Test, believing that it is more important to study the underlying principles of intelligence than to duplicate an exemplar. The quest for \"artificial flight\" succeeded when the Wright brothers and others stopped imitating birds and started using wind tunnels and learning about aerodynamics. Aeronautical engineering texts do not define the goal of their field as making \"machines that fly so exactly like pigeons that they can fool even other pigeons.\"",
      "lang": "en",
      "author": "Stuart Russell, Peter Norvig"
    },
    {
      "tags": [
        "suffering",
        "ethics",
        "rationality",
        "society",
        "negative utilitarianism",
        "policy"
      ],
      "quote": "If people are badly off, suffering, or otherwise remediably miserable, it is not appropriate to address their ill-being by bringing more happy people into the world to counterbalance their disadvantage. We should instead improve the situation of those who are badly off.",
      "lang": "en",
      "author": "Clark Wolf"
    },
    {
      "tags": [
        "business",
        "negotiating"
      ],
      "quote": "The reason you negotiate is to produce something better than the results you can obtain without negotiating. What are those results? What is that alternative? What is your BATNA—your Best Alternative To a Negotiated Agreement? That is the standard against which any proposed agreement should be measured. That is the only standard that can protect you both from accepting terms that are too unfavorable and from rejecting terms it would be in your interest to accept.",
      "lang": "en",
      "author": "Roger Fisher, William L. Ury"
    },
    {
      "tags": [
        "short",
        "software engineering",
        "advice"
      ],
      "quote": "Identify the aspects of your application that vary and separate them from what stays the same.",
      "lang": "en",
      "author": "Elisabeth Freeman, Kathy Sierra"
    },
    {
      "tags": [
        "suffering",
        "ethics",
        "animals"
      ],
      "quote": "The question is not Can they reason?, nor Can they talk?, but Can they suffer?",
      "lang": "en",
      "author": "Jeremy Bentham"
    },
    {
      "tags": [
        "analogy",
        "consciousness",
        "panpsychism"
      ],
      "quote": "We can interpret any piece of matter as being conscious if we want to, but in many cases it doesn't make sense to most of us to speak that way. Panpsychism is analogous to \"pantableism\" -- the view that tableness is intrinsic to all matter. There is some sense in which you can interpret any piece of matter as being a table. After all, for any (solid) clump of atoms, you can put stuff on it, and it can support the things that it holds. But this definition is really a stretch for most objects. So it is with saying that everything is conscious.",
      "lang": "en",
      "author": "Brian Tomasik"
    },
    {
      "tags": [
        "science",
        "short",
        "management",
        "startup",
        "rule"
      ],
      "quote": "When a measure becomes a target, it ceases to be a good measure.",
      "lang": "en",
      "author": "Marilyn Strathern"
    },
    {
      "tags": [
        "short",
        "advice",
        "poem"
      ],
      "quote": "If no thought\nyour mind does visit,\nmake your speech\nnot too explicit.",
      "lang": "en",
      "author": "Piet Hein"
    },
    {
      "tags": [
        "consumerism",
        "factory farming",
        "suffering",
        "ethics",
        "vegan"
      ],
      "quote": "[...] The important question is not whether animal flesh could be produced without suffering, but whether the flesh we are considering buying was produced without suffering.",
      "lang": "en",
      "author": "Peter Singer"
    },
    {
      "tags": [
        "skepticism",
        "atheism",
        "short",
        "religion",
        "society"
      ],
      "quote": "Religion is about turning untested belief into unshakable truth through the power of institutions and the passage of time.",
      "lang": "en",
      "author": "Richard Dawkins"
    },
    {
      "tags": [
        "death",
        "skepticism",
        "suffering",
        "ethics",
        "evolution",
        "rationality"
      ],
      "quote": "[...], to accept continued survival at virtually any cost, including the cost of increasing the net amount of extreme suffering in the world, is, I would argue, highly implausible. Beyond that, one can argue that we, for evolutionary reasons, also wildly overestimate the ethical badness of an empty world, and grossly misjudge the value of the absence of sentience. Indeed, on a pure sentiocentric view, such an absence is just as good as deep, dreamless sleep. And what is so bad about that?",
      "lang": "en",
      "author": "Magnus Vinding"
    },
    {
      "tags": [
        "skepticism",
        "atheism",
        "consciousness"
      ],
      "quote": "The fact that one can lose one's sense of self in an ocean of tranquility does not mean that one's consciousness is immaterial or that it presided over the birth of the universe.",
      "lang": "en",
      "author": "Sam Harris"
    },
    {
      "tags": [
        "religion",
        "rationality",
        "humans"
      ],
      "quote": "If every trace of religion was magically eliminated from the world tomorrow, then—however much improved the lives of many people would be—we would not even have come close to solving the larger failures of sanity that made religion possible in the first place.",
      "lang": "en",
      "author": "Eliezer Yudkowsky"
    },
    {
      "tags": [
        "short",
        "religion",
        "society"
      ],
      "quote": "[Y]ou must assume the responsibility for what you believe.",
      "lang": "en",
      "author": "Richard Hamming"
    },
    {
      "tags": [
        "suffering",
        "transhumanism",
        "future"
      ],
      "quote": "One should be wary of assuming that we're the folk who can properly look after ourselves, whereas our descendants, if they become genetically pre-programmed ecstatics, will get trapped in robot-serviced states of infantile dependence. For it shouldn't be forgotten that exuberantly happy people also have a fierce will to survive. They love life dearly. They take on daunting challenges against seemingly impossible odds. One of the hallmarks of many endogenous depressive states, on the other hand, is so-called behavioural despair. If one learns that apparently no amount of effort can rescue one from an aversive stimulus, then one tends to sink into a lethargic stupor. This syndrome of \"learned helplessness\" may persist even when the opportunity to escape from the nasty stimulus subsequently arises.",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "short",
        "software engineering",
        "business",
        "advice",
        "startup"
      ],
      "quote": "When you're asked to provide an estimate, determine whether you're supposed to be estimating or figuring out how to hit a target.",
      "lang": "en",
      "author": "Steve McConnell"
    },
    {
      "tags": [
        "analogy",
        "software engineering",
        "business",
        "startup",
        "productivity"
      ],
      "quote": "You cannot take a photo any faster by assigning more photographers. You cannot deliver a speech any quicker by adding more speakers. After a construction site is fi lled with workers, you cannot add any more and hope to increase productivity; they will trip over each other and progress will slow down.",
      "lang": "en",
      "author": "Edward Guiness"
    },
    {
      "tags": [
        "saying",
        "short",
        "advice"
      ],
      "quote": "Do only one stupid thing at a time.",
      "lang": "en"
    },
    {
      "tags": [
        "science",
        "skepticism",
        "rationality",
        "knowledge"
      ],
      "quote": "Your strength as a rationalist is your ability to be more confused by fiction than by reality. If you are equally good at explaining any outcome, you have zero knowledge.",
      "lang": "en",
      "author": "Eliezer Yudkowsky"
    },
    {
      "tags": [
        "business",
        "politics",
        "negotiating"
      ],
      "quote": "You will satisfy your interests better if you talk about where you would like to go rather than about where you have come from. Instead of arguing with the other side about the past — about last quarter's costs (which were too high), last week's action (taken without adequate authority), or yesterday's performance (which was less than expected) — talk about what you want to have happen in the future. Instead of asking them to justify what they did yesterday, ask, \"Who should do what tomorrow?\"",
      "lang": "en",
      "author": "William Ury, Roger Fisher"
    },
    {
      "tags": [
        "vegan",
        "animals",
        "capitalism",
        "language"
      ],
      "quote": "My piece of advice to give to new vegans would be to urge them to replace the term ‘owner’ with the term ‘guardian’ when referring to their relationship with their animal companions and other kindred beings. So they may not only not eat them, but that they take a proactive role in changing the existing paradigm that sees and treats other species as no more than mere property, objects, resources, commodities, and things.",
      "lang": "en",
      "author": "Elliot M. Katz"
    },
    {
      "tags": [
        "machine learning",
        "science",
        "short",
        "ai"
      ],
      "quote": "What machines are picking up on are not facts about the world. They’re facts about the dataset.",
      "lang": "en",
      "author": "Dhruv Batra"
    },
    {
      "tags": [
        "god",
        "science",
        "atheism",
        "rationality"
      ],
      "quote": "We cannot, of course, disprove God, just as we can't disprove Thor, fairies, leprechauns and the Flying Spaghetti Monster.",
      "lang": "en",
      "author": "Richard Dawkins"
    },
    {
      "tags": [
        "transhumanism",
        "future",
        "psychedelics",
        "mind"
      ],
      "quote": "[...] our descendants may be not just superintelligent but supersentient - blessed with the capacity to shift between a multitude of radically different modes of consciousness whose only common ingredient is the molecular signature of bliss. Posthuman mastery of reward circuitry will let them safely explore psychedelia in a way most humans beings don't dare.",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "individualism",
        "ethics",
        "transhumanism",
        "mind"
      ],
      "quote": "[...] we must recognize that our limitation to experience what other bodies experience now, in the present, is similar to the limitation that we have to experience our own experiences of the past and of the future. There is not much difference between \"our\" experiences and \"those of others\", rather than the associations that we are making in our mind, through memories of the past and forecasts of the future.",
      "lang": "en",
      "author": "Manu Herrán"
    },
    {
      "tags": [
        "antinatalism",
        "ethics"
      ],
      "quote": "[...] the true reason for making someone to come into being is never for the person’s own sake, but always for the interest of his/her progenitors, in a clear attitude of manipulation; radical manipulation indeed because, in contrast with usual manipulation of people already alive, manipulation in procreation affects the very being of the person, and not only some of his/her predicates.",
      "lang": "en",
      "author": "Julio Cabrera"
    },
    {
      "tags": [
        "suffering",
        "psychedelic",
        "pain",
        "short"
      ],
      "quote": "When one is gripped by excruciating physical pain, one is always shocked at just how frightful it can be.",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "suffering",
        "ethics",
        "nature",
        "cats",
        "predation"
      ],
      "quote": "In a triumph of aestheticism over morality, many animal lovers otherwise sympathetic to the sentiments expressed here will doubtless be aghast at the very idea of losing such lovable companions and time-honoured killers as members of the cat family; but then they are unlikely to be hunted down in terror or physically eaten alive, which lends a rather different perspective to any issue at all.",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "research",
        "science"
      ],
      "quote": "Assigning fixed quantitative values to arbitrary qualitative categories results only in false precision and gives the impression that the measurement contains more information than the researcher actually has.",
      "lang": "en",
      "author": "Mark D. White"
    },
    {
      "tags": [
        "short",
        "strategy"
      ],
      "quote": "[I]t is far better to know the terrain than to plan on taking one particular path through the woods.",
      "lang": "en",
      "author": "Roger Fisher, William Ury"
    },
    {
      "tags": [
        "utilitarianism"
      ],
      "quote": "[U]nlike positive utilitarianism or so-called preference utilitarianism - neither of which can ever be wholly fulfilled - [negative utilitarianism] seems achievable in full.",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "love",
        "skepticism",
        "short"
      ],
      "quote": "Love is a gross exaggeration of the difference between one person and everybody else.",
      "lang": "en"
    },
    {
      "tags": [
        "software engineering",
        "startup",
        "ux",
        "design"
      ],
      "quote": "When are you done? Since design is open-ended, the most common answer to that question is \"When you’re out of time.\"",
      "lang": "en",
      "author": "Steve McConnell"
    },
    {
      "tags": [
        "future",
        "x-risks",
        "religion",
        "apocalypse"
      ],
      "quote": "To be clear, most people who believe in the end-times narratives of their ancient holy texts are passive spectators of the apocalypse. But at the statistical margins are what we might call eschatological activists intent on fulfilling prophecy themselves. Such individuals are the exception, not the rule, but this fact will become increasingly irrelevant in the world anticipated by existential riskologists.",
      "lang": "en",
      "author": "Phil Torres"
    },
    {
      "tags": [
        "short",
        "software engineering",
        "programming",
        "testing",
        "tdd"
      ],
      "quote": "It's the quality of the tests that matters, not the quantity.",
      "lang": "en",
      "author": "Paul Gries, Jennifer Campbell, Jason Montojo"
    },
    {
      "tags": [
        "science"
      ],
      "quote": "Ideas in the physical sciences have evolved under several basic selection rules. First, scientists ignore ideas that lack testable consequences; they thus keep their heads from being clogged by useless parasites. Second, scientists seek replacements for ideas that have failed tests. Finally, scientists seek ideas that make the widest possible range of exact predictions",
      "lang": "en",
      "author": "K. Eric Drexler"
    },
    {
      "tags": [
        "definition",
        "creativity",
        "entrepreneurship",
        "short"
      ],
      "quote": "Vuja de is when you look at something you've seen many times before and all of a sudden see it with fresh eyes.",
      "lang": "en"
    },
    {
      "tags": [
        "business",
        "advice",
        "startup"
      ],
      "quote": "Constraints are often advantages in disguise. Forget about venture capital, long release cycles, and quick hires. Instead, work with what you have.",
      "lang": "en",
      "author": "37signals"
    },
    {
      "tags": [
        "short",
        "brain",
        "mind"
      ],
      "quote": "Brains cause minds.",
      "lang": "en"
    },
    {
      "tags": [
        "evolution",
        "humans",
        "society",
        "males"
      ],
      "quote": "The ocean of male language that confronts modern women in bookstores, television, newspapers, classrooms, parliaments, and businesses does not necessarily come from a male conspiracy to deny women their voice. It may come from an evolutionary history of sexual selection in which the male motivation to talk was vital to their reproduction.",
      "lang": "en",
      "author": "Geoffrey Miller"
    },
    {
      "tags": [
        "skepticism",
        "earth",
        "conservationism",
        "environmentalism"
      ],
      "quote": "Earth has undergone radical changes throughout its 3.5 billion year history, and as such, it would be curious if it had just now reached the state that is intrinsically valuable and ought to be preserved in perpetuity.",
      "lang": "en",
      "author": "Ole Martin Moen"
    },
    {
      "tags": [
        "short",
        "consciousness",
        "rationality",
        "bias"
      ],
      "quote": "We seek a pattern, and we find one.",
      "lang": "en",
      "author": "Carl Sagan"
    },
    {
      "tags": [
        "ethics"
      ],
      "quote": "Helping is not, as conventionally thought, a charitable act that it is praiseworthy to do, but not wrong to omit; it is something that everyone ought to do.",
      "lang": "en",
      "author": "Peter Singer"
    },
    {
      "tags": [
        "ai",
        "computer science",
        "simulation"
      ],
      "quote": "A computer cannot realise a solution of the Navier-Stokes equations in which the solution variables refer to atmospheric pressure, velocity, density etc. because a computer does not possess these quantities. A computer can only represent variables such as atmospheric pressure.",
      "lang": "en",
      "author": "Gordon McCabe"
    },
    {
      "tags": [
        "evolution",
        "short",
        "society",
        "education"
      ],
      "quote": "Let us try to teach generosity and altruism, because we are born selfish.",
      "lang": "en",
      "author": "Richard Dawkins"
    },
    {
      "tags": [
        "science",
        "short"
      ],
      "quote": "It is much easier to train people to test ideas, than to have good ideas to test.",
      "lang": "en",
      "author": "Eliezer Yudkowsky"
    },
    {
      "tags": [
        "skepticism",
        "atheism",
        "religion"
      ],
      "quote": "Religious moderation is the direct result of taking scripture less and less seriously. So why not take it less seriously still? Why not admit that the Bible is merely a collection of imperfect books written by highly fallible human beings?",
      "lang": "en",
      "author": "Sam Harris"
    },
    {
      "tags": [
        "suffering",
        "ethics"
      ],
      "quote": "[T]he pain-pleasure axis discloses the world's inbuilt metric of (dis)value, and that acting unethically ultimately is a function of ignorance – ignorance, I would add, about what others feel, and about our not being fundamentally different from others.",
      "lang": "en",
      "author": "Magnus Vinding"
    },
    {
      "tags": [
        "science",
        "skepticism",
        "rationality"
      ],
      "quote": "The critical attitude may be described as the conscious attempt to make our theories, our conjectures, suffer in our stead in the struggle for the survival of the fittest. It gives us a chance to survive the elimination of an inadequate hypothesis — when a more dogmatic attitude would eliminate it by eliminating us.",
      "lang": "en",
      "author": "Karl Popper"
    },
    {
      "tags": [
        "software engineering",
        "advice",
        "ux",
        "design"
      ],
      "quote": "Context is more important than consistency. It's ok to be inconsistent if your design makes more sense that way. Give people just what matters. Give them what they need when they need it and get rid of what they don’t. It’s better to be right than to be consistent.",
      "lang": "en",
      "author": "37signals"
    },
    {
      "tags": [
        "ethics",
        "vegan",
        "evolution",
        "history"
      ],
      "quote": "[B]oth natural selection and the historical record offer powerful reasons for doubting the trustworthiness of our naive moral intuitions. So the possibility that human civilisation might be founded upon some monstrous evil should be taken seriously - even if the possibility seems transparently absurd at the time.",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "science",
        "short"
      ],
      "quote": "Unexplained does not mean inexplicable.",
      "lang": "en"
    },
    {
      "tags": [
        "god",
        "science",
        "skepticism",
        "religion",
        "rationality"
      ],
      "quote": "The anti-work of anti-epistemology is to manufacture belief without evidence, and in large answer spaces, attention without evidence is more than halfway to belief without evidence. Someone who spends all day pondering whether the Trinity does or does not exist - rather than Allah, Thor, or the Flying Spaghetti Monster - is more than halfway converted to Christianity.",
      "lang": "en"
    },
    {
      "tags": [
        "ai",
        "consciousness",
        "brain"
      ],
      "quote": "Paradoxically, our sense of continuity comes from our marvelous insensitivity to most kinds of changes rather than from any genuine perceptiveness. Existence seems continuous to us not because we continually experience what is happening in the present, but because we hold to our memories of how things were in the recent past. Without those short-term memories, all would seem entirely new at every instant, and we would have no sense at all of continuity or, for that matter, of existence.",
      "lang": "en",
      "author": "Marvin Minsky"
    },
    {
      "tags": [
        "suffering",
        "ethics",
        "transhumanism"
      ],
      "quote": "Simply by deciding to have genetically unenriched children, for instance, one perpetuates the biology of suffering by bringing more code for its substrates into world. A healthy caution toward untested novelties should not collapse into status quo bias.",
      "lang": "en",
      "author": "David Pearce"
    },
    {
      "tags": [
        "science",
        "suffering",
        "ethics",
        "utilitarianism",
        "negative utilitarianism"
      ],
      "quote": "It adds to clarity in the field of ethics if we formulate our demands negatively, i.e. if we demand the elimination of suffering rather than the promotion of happiness. Similarly, it is helpful to formulate the task of scientific method as the elimination of false theories (from the various theories tentatively proffered) rather than the attainment of established truths.",
      "lang": "en",
      "author": "Karl Popper"
    },
    {
      "tags": [
        "science",
        "short",
        "technology",
        "nanotechnology"
      ],
      "quote": "Ribosomes are proof that nanomachines built of protein and RNA can be programmed to build complex molecules.",
      "lang": "en",
      "author": "Kim Eric Drexler"
    },
    {
      "tags": [
        "science",
        "evolution",
        "analogy",
        "animals"
      ],
      "quote": "[A marketing orientation in evolution] puts courtship at the heart of modern biology, as marketing is at the heart of modern business.",
      "lang": "en",
      "author": "Geoffrey Miller"
    },
    {
      "tags": [
        "philosophy",
        "ethics",
        "short",
        "consciousness"
      ],
      "quote": "If there is an argument for caring about things that have no impact on any state of consciousness, I have yet to encounter it.",
      "lang": "en",
      "author": "Andrés Gómez Emilsson"
    },
    {
      "tags": [
        "psychedelics",
        "mind"
      ],
      "quote": "Holding onto control causes negative experiences and amplifies anxiety; letting go of control and embracing unconstrained perception is a central psychedelic tenet.",
      "lang": "en",
      "author": "James L. Kent"
    },
    {
      "tags": [
        "antinatalism",
        "life",
        "children",
        "skepticism",
        "suffering",
        "ethics"
      ],
      "quote": "It is curious that while good people go to great lengths to spare their children from suffering, few of them seem to notice that the one (and only) guaranteed way to prevent all the suffering of their children is not to bring those children into existence in the first place.",
      "lang": "en",
      "author": "David Benatar"
    }
  ]
}
